title: Sysmon Network Connection to Suspect Port
id: 5693c662-811c-4b6b-a249-10645c3a4f61
status: stable
description: Detects network connections to ports commonly used by C2 or malware
author: CyberThreatX
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 3
    ports:
        DestinationPort:
            - 4444
            - 5555
            - 8888
            - 9999
            - 6667
            - 1337
    condition: selection and ports
level: medium
tags:
    - attack.command_and_control
    - attack.t1043
