title: Credential Dumping - SAM/SYSTEM via Reg
id: 0d2cae81-5514-403c-ad3f-d4d6afd3c810
status: stable
description: Generated rule for Credential Dumping - SAM/SYSTEM via Reg
author: CyberThreatX Generator
logsource:
  product: windows
  category: process_creation
  service: null
detection:
  selection:
    Image|endswith:
    - \reg.exe
    CommandLine|contains:
    - save hklm\sam
    - save hklm\system
    - save hklm\security
  condition: selection
level: medium
tags:
- attack.generated
