title: Credential Dumping - LSASS via Taskmgr
id: 7f25715e-2cb1-41ff-8964-58985c003c1e
status: stable
description: Generated rule for Credential Dumping - LSASS via Taskmgr
author: CyberThreatX Generator
logsource:
  product: windows
  category: process_creation
  service: null
detection:
  selection:
    Image|endswith:
    - \taskmgr.exe
    CommandLine|contains:
    - /dump
    - -dump
  condition: selection
level: medium
tags:
- attack.generated
