title: Execution - Mavinject Usage
id: 719fa8d5-5672-4df0-9a48-428f86dd80ab
status: stable
description: Generated rule for Execution - Mavinject Usage
author: CyberThreatX Generator
logsource:
  product: windows
  category: process_creation
  service: null
detection:
  selection:
    Image|endswith:
    - \mavinject.exe
    CommandLine|contains:
    - /INJECTRUNNING
  condition: selection
level: medium
tags:
- attack.generated
