title: Registry - Disable UAC
id: b23a8942-e293-4af9-a76e-d6a0d35888f4
status: stable
description: Generated rule for Registry - Disable UAC
author: CyberThreatX Generator
logsource:
  product: windows
  category: registry
  service: null
detection:
  selection: {}
  condition: selection
level: medium
tags:
- attack.generated
